In [52]:
import numpy as np
import pandas as pd

In [50]:
data=pd.Series(np.linspace(0,1,5))
data

0    0.00
1    0.25
2    0.50
3    0.75
4    1.00
dtype: float64

In [51]:
data.values

array([0.  , 0.25, 0.5 , 0.75, 1.  ])

In [7]:
data.index

RangeIndex(start=0, stop=5, step=1)

In [8]:
data=pd.Series(np.linspace(0,1,5),
               index=['a','b','c','d','e'])
data

a    0.00
b    0.25
c    0.50
d    0.75
e    1.00
dtype: float64

In [13]:
pinCode={"Mumbai":670011,
         "Chennai":603203,
         "Kolkata":660011,
         "Bangalore":640320}
pinCode=pd.Series(pinCode)
pinCode

Mumbai       670011
Chennai      603203
Kolkata      660011
Bangalore    640320
dtype: int64

In [14]:
areaMeasure={"Mumbai":600000,
         "Chennai":650000,
         "Kolkata":660000,
         "Bangalore":640000}
areaMeasure=pd.Series(areaMeasure)
areaMeasure

Mumbai       600000
Chennai      650000
Kolkata      660000
Bangalore    640000
dtype: int64

In [15]:
cityFrame=pd.DataFrame({'pincode':pinCode,
                        'area':areaMeasure})
cityFrame

           pincode    area
Mumbai      670011  600000
Chennai     603203  650000
Kolkata     660011  660000
Bangalore   640320  640000

In [19]:
pd.DataFrame(np.random.randint(10,size=(3,3)),
             columns=['1','2','3'],
             index=['a','b','c'])

   1  2  3
a  0  7  5
b  3  2  2
c  1  7  1

In [20]:
data=pd.Series(np.linspace(0,1,5),
               index=['a','b','c','d','e'])
data

a    0.00
b    0.25
c    0.50
d    0.75
e    1.00
dtype: float64

In [28]:
pin=pd.Series({'Kannur':670011,'Chennai':603203,'Bangalore':632432})
area=pd.Series({'Kannur':20000,'Chennai':50000,'Bangalore':55000})
data=pd.DataFrame({'area':area,'pin':pin})
data

            area     pin
Kannur     20000  670011
Chennai    50000  603203
Bangalore  55000  632432

In [29]:
data.area

Kannur       20000
Chennai      50000
Bangalore    55000
Name: area, dtype: int64

In [30]:
data.pin

Kannur       670011
Chennai      603203
Bangalore    632432
Name: pin, dtype: int64

In [38]:
print(data.loc['Kannur'])

print(data.iloc[1])

area     20000
pin     670011
Name: Kannur, dtype: int64
area     50000
pin     603203
Name: Chennai, dtype: int64

In [39]:
import numpy as np
import pandas as pd

In [41]:
vals1=np.array([1,None,3,4])
vals1

array([1, None, 3, 4], dtype=object)

vals1.sum()
//Here error is thrown because any operation with nan gives an error

In [62]:
vals2=np.array([1,np.nan,3,4])
vals2.dtype

dtype('float64')

In [46]:
1+vals2[1]

nan

In [47]:
1*vals2[1]

nan

In [54]:
print(vals2.sum(),vals2.min(),vals2.max())

nan nan nan

In [61]:
print(np.nansum([1,2,np.nan]))

3.0

In [59]:
np.__version__

'1.23.5'

In [64]:
print(np.nansum(vals2),np.nanmin(vals2),np.nanmax(vals2))

8.0 1.0 4.0

In [65]:
data=pd.Series([1,np.nan,'hello',None,'world'])
data

0        1
1      NaN
2    hello
3     None
4    world
dtype: object

In [66]:
data.isnull()

0    False
1     True
2    False
3     True
4    False
dtype: bool

In [69]:
x=data[data.notnull()]
x

0        1
2    hello
4    world
dtype: object

In [74]:
data.dropna()

0        1
2    hello
4    world
dtype: object

In [75]:
df=pd.DataFrame([[1,np.nan,2],
                 [2,3,5],
                 [np.nan,4,6]])
df

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

In [76]:
df.dropna()

     0    1  2
1  2.0  3.0  5

In [78]:
df.dropna(axis='columns')

   2
0  2
1  5
2  6

In [79]:
data=pd.Series([1,np.nan,2,None,3])
data

0    1.0
1    NaN
2    2.0
3    NaN
4    3.0
dtype: float64

In [80]:
data.fillna(0)

0    1.0
1    0.0
2    2.0
3    0.0
4    3.0
dtype: float64

In [81]:
data.ffill()

0    1.0
1    1.0
2    2.0
3    2.0
4    3.0
dtype: float64

In [82]:
df

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

In [83]:
df.fillna(0)

     0    1  2
0  1.0  0.0  2
1  2.0  3.0  5
2  0.0  4.0  6

In [85]:
df.fillna(method='ffill',axis=1)

     0    1    2
0  1.0  1.0  2.0
1  2.0  3.0  5.0
2  NaN  4.0  6.0

In [87]:
df.fillna(method='bfill',axis=1)

     0    1    2
0  1.0  2.0  2.0
1  2.0  3.0  5.0
2  4.0  4.0  6.0